
# 波形パラメータとして取り得る値の最大値
upper_limit = {
    # ユーザ定義波形の先頭の 0 データの AWG ワード数
    'num_wait_words' : 10,

     # 波形シーケンスを繰り返す回数
    'num_seq_repeats' : 3,
    
    # 波形シーケンスに含まれる波形チャンクの個数 (1 ~ 16)
    'num_chunks' : 16,

    # 各波形チャンクの繰り返し回数.
    # 波形チャンク n (0 ~ 15) の繰り返し回数が, リストの n 番目に格納される.
    'num_chunk_repeats_list' : [8] * 16,
    
    # 各波形チャンクの波形パートの AWG ワード数. 
    # 波形チャンク n (0 ~ 15) の波形パートの AWG ワード数が, リストの n 番目に格納される.
    # リストの各要素は 16 の倍数を指定すること.
    'num_wave_words_list' : [64] * 16,
    
    # 各波形チャンクのポストブランクの AWG ワード数.
    # 波形チャンク n (0 ~ 15) のポストブランクの AWG ワード数が, リストの n 番目に格納される.
    'num_post_blank_words_list' : [10] * 16
}
